src/main/resources/atscale-small/0013-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="58EC67E6-8668-4A29-BA07-491F8C4E2B18"/>
  </soap:Header>
  <soap:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>MDSCHEMA_PROPERTIES</RequestType>
      <Restrictions>
        <RestrictionList>
          <CUBE_NAME>AS Adventure Micro</CUBE_NAME>
          <PROPERTY_NAME>MEMBER_VALUE</PROPERTY_NAME>
          <PROPERTY_TYPE>5</PROPERTY_TYPE>
          <PROPERTY_VISIBILITY>3</PROPERTY_VISIBILITY>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList>
          <Catalog>ASAdventureMicro</Catalog>
          <SafetyOptions>2</SafetyOptions>
          <MdxMissingMemberMode>Error</MdxMissingMemberMode>
          <DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse>
          <DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID>
          <DbpropMsmdRequestID>C074113C-3150-48BA-BF47-B81D6FE157F9</DbpropMsmdRequestID>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility>
          <DbpropMsmdSubqueries>2</DbpropMsmdSubqueries>
        </PropertyList>
      </Properties>
    </Discover>
  </soap:Body>
</soap:Envelope>